## **Pandas :** Overview

#### _Fondamentaux sur la libraire Pandas_

üü¢ `complete`

---

1. **Composants**
    * Objet `Serie`
    * Objet `DataFrame`
2. **Lecture et √©criture de fichiers**
    * Fichier CSV
    * Fichier JSon
    * Fichier Excel
3. **Observations**
    * M√©thodes
    * Propri√©t√©s
4. **Acc√®s lignes et colonnes**
    * Indexation
    * S√©lection
    * Indexation bool√©enne
    * √âdition (cas pratiques)
    * Sp√©cificit√© syntaxique
5. **Agr√©gations**
    * Regroupement
    * Statistiques
    * Calculs (cas pratiques)

**Libraries**

In [2]:
import pandas as pd
import numpy as np

**Libraries setup**

In [3]:
# Options diverses pour l'affichage et la personnalisation des graphiques

# Par d√©faut : 10 lignes minimum
# pd.options.display.min_rows # 10

# Par d√©faut : 60 lignes maximum
# pd.options.display.max_rows

# Modification
pd.options.display.max_rows = 50
pd.options.display.min_rows = 6

---
### **1.** Composants

##### **1.1** - Objet `Series`

Cr√©ations `pd.Serie()`

In [4]:
# S√©rie indic√©e :: Liste Python
list_ = [4, -5, 7]
serie = pd.Series(list_)
serie

0    4
1   -5
2    7
dtype: int64

In [5]:
# S√©rie labell√©e :: Association d'index
serie_idx = [45.88, 99.4, 71.3]
serie_idx = pd.Series(serie_idx, index=['x', 'y', 'z'], name='Coords')
serie_idx

x    45.88
y    99.40
z    71.30
Name: Coords, dtype: float64

In [6]:
# S√©rie cl√©/valeur :: Dictionnaire Python
dict_ = {"day1": 420, "day2": 380, "day3": 390}
serie_dict = pd.Series(dict_, name='Calories')
serie_dict

day1    420
day2    380
day3    390
Name: Calories, dtype: int64

In [7]:
# S√©rie par valeur scalaire - [!] Index n√©cessaires
serie_scalar = pd.Series(5.0, index=['a', 'b', 'c', 'd'])
serie_scalar

a    5.0
b    5.0
c    5.0
d    5.0
dtype: float64

In [8]:
# S√©rie par NumPy
serie_rand = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
serie_rand

a    0.453853
b   -0.082283
c   -0.332823
d   -0.687524
e   -0.185423
dtype: float64

Valeurs et plages avec `[i]`, `[:i]`, _etc._

In [9]:
# Valeurs seules
display(
    serie_rand[1], # Par son 'indice'
    serie_rand['c'] # Par son 'label'
)

-0.08228341984431947

-0.33282258947505483

In [10]:
# Plages de valeurs
display(
    serie_rand[:2],
    serie_rand[3:]
)

a    0.453853
b   -0.082283
dtype: float64

d   -0.687524
e   -0.185423
dtype: float64

In [11]:
# Multiples valeurs non-successives
display(
    serie_rand[['b', 'd', 'c']], # b, d et c choisies dans cet ordre
    serie_rand[[4, 0, 1]] # 4, 0 et 1 choisies dans cet ordre
)

b   -0.082283
d   -0.687524
c   -0.332823
dtype: float64

e   -0.185423
a    0.453853
b   -0.082283
dtype: float64

Particularit√©s `na`, `NaN`

In [12]:
# Valeurs manquantes
serie_copied = serie_rand[1:] + serie_rand[:-1]

display(serie_copied)

serie_copied.dropna() # Renvoie une projection du tableau sans les valeurs manquantes - [!] ne modifie pas le tableau original

a         NaN
b   -0.164567
c   -0.665645
d   -1.375048
e         NaN
dtype: float64

b   -0.164567
c   -0.665645
d   -1.375048
dtype: float64

##### **1.2** - Objet `Dataframe`

Cr√©ation `pd.DataFrame()`

In [13]:
# Series individuelles et nomm√©es
notes = pd.Series(np.random.randint(0,10,5), name='notes')
months = pd.Series(['jan', 'feb', 'mar', 'apr', 'may', 'jun'], name='months')

progress_scores = pd.DataFrame([months, notes])

progress_scores

          0    1    2    3    4    5
months  jan  feb  mar  apr  may  jun
notes   2.0  4.0  2.0  5.0  9.0  NaN

In [14]:
# Dictionnaire de S√©ries
year_scores = pd.DataFrame({'months': months, 'notes': notes}) 

year_scores

  months  notes
0    jan    2.0
1    feb    4.0
2    mar    2.0
3    apr    5.0
4    may    9.0
5    jun    NaN

In [15]:
# Indic√© et colonn√© :: Dictionnaire Python
students = pd.DataFrame({
        'first_name': ["Ada", "Alan", "Margaret"],
        'last_name': ["Lovelace", "Turing", "Hamilton"],
        'notes': np.random.randint(0,20,3)
    })

students

  first_name last_name  notes
0        Ada  Lovelace      7
1       Alan    Turing     17
2   Margaret  Hamilton      1

Lignes et plage avec `.loc[i]`, `.loc[:i]`, _etc._

In [16]:
# Lignes individuelles
students.loc[1]

first_name      Alan
last_name     Turing
notes             17
Name: 1, dtype: object

In [17]:
# Plages de lignes exclusives - Sans .loc
display( year_scores[2:4] )

# Plage de lignes inclusive - Avec .loc
year_scores.loc[2:4]

  months  notes
2    mar    2.0
3    apr    5.0

  months  notes
2    mar    2.0
3    apr    5.0
4    may    9.0

In [18]:
# Plage inf√©rieure
year_scores.loc[:3]

  months  notes
0    jan    2.0
1    feb    4.0
2    mar    2.0
3    apr    5.0

In [19]:
# Plage sup√©rieure
year_scores.loc[3:]

  months  notes
3    apr    5.0
4    may    9.0
5    jun    NaN

In [20]:
# Multiples lignes non-successives
year_scores.loc[[1,3,5]]

  months  notes
1    feb    4.0
3    apr    5.0
5    jun    NaN

---
### **2.** Lecture et √©criture de fichiers

##### **2.1** - Fichiers CSV

M√©thode `read_csv()`

In [21]:
# Chargement basique
sport_health_csv = '../_datasets/sport_health.csv'
csv_data = pd.read_csv(sport_health_csv)
csv_data

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
..        ...    ...       ...       ...
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [22]:
# Chargement param√®tr√© :: delimiter, index_col, etc.
weather_data_raw = '../_datasets/weather_data'
raw_data = pd.read_csv(weather_data_raw, delimiter='|', index_col='city') # [!] - Utilisation de .iloc pour s√©lection par index naturels
raw_data

           temp_c          o3
city
Bruxelles    23.0  114.400002
Namur        22.0  108.699997
New-York     21.1    0.600000
Shablagou     NaN         NaN
Tokyo        29.0   73.699997

M√©thode `to_csv()`

In [23]:
# Exportation basique
# (√† compl√©ter)

##### **2.2** - Fichiers JSon

M√©thode `read_json()`

In [24]:
# Chargement basique
sport_health_json = '../_datasets/sport_health.json'
json_data = pd.read_json(sport_health_json)
json_data

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
..        ...    ...       ...       ...
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

M√©thode `to_json()`

In [25]:
# Exportation basique
# (√† compl√©ter)

##### **2.3** - Fichiers Excel

M√©thode `read_excel()`

In [ ]:
# N√©cessite 'openpyxl'
# pd.read_excel("path_to_file.xls", sheet_name="Sheet1")

---
### **3.** Observations

##### **3.1** - M√©thodes `.head()`, `.tail()`, `sort_values()`, etc.

_N-premi√®res_ ou _N-derni√®res_ lignes

In [26]:
# Les N premi√®res lignes :: 5 par d√©faut
display(json_data.head(3))

# Les N derni√®res lignes :: 5 par d√©faut
json_data.tail(3)

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0

     Duration  Pulse  Maxpulse  Calories
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

Trier les valeurs

In [27]:
# Par d√©faut :: Colonne d'index
json_data.sort_index(ascending=False)

     Duration  Pulse  Maxpulse  Calories
168        75    125       150     330.4
167        75    120       150     320.4
166        60    115       145     310.2
..        ...    ...       ...       ...
2          60    103       135     340.0
1          60    117       145     479.0
0          60    110       130     409.1

[169 rows x 4 columns]

In [28]:
# Par valeur :: Une colonne
json_data.sort_values(by='Maxpulse')

     Duration  Pulse  Maxpulse  Calories
103        90     90       100     500.4
93         15     80       100      50.5
102        90     90       100     500.0
..        ...    ...       ...       ...
3          45    109       175     282.4
80         30    159       182     319.2
109       210    137       184    1860.4

[169 rows x 4 columns]

In [29]:
# Valeurs successives :: Multiples colonnes
json_data.sort_values(by=['Maxpulse', 'Pulse'], ascending=False)

     Duration  Pulse  Maxpulse  Calories
109       210    137       184    1860.4
80         30    159       182     319.2
54         30    136       175     238.0
..        ...    ...       ...       ...
102        90     90       100     500.0
103        90     90       100     500.4
93         15     80       100      50.5

[169 rows x 4 columns]

Informations g√©n√©rales

In [30]:
# Informations compl√®tes
json_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 6.6 KB

##### **3.2** - Propri√©t√©s `.dtypes`, `.columns`, `.shape`, `.size`, etc.

In [31]:
# Colonnes
students.columns

Index(['first_name', 'last_name', 'notes'], dtype='object')

In [32]:
# Forme
students.shape

(3, 3)

In [33]:
# Quantit√© d'√©l√©ments
students.size

9

In [34]:
# Types pour chaque colonnes
students.dtypes

first_name    object
last_name     object
notes          int32
dtype: object

---
### **4.** Acc√®s lignes et colonnes

_Exemple 1_

In [35]:
# Exemple 1 : Dataframe avec des lignes et des colonnes labell√©es => Les identifiants de lignes sont des dates
labeled = pd.DataFrame(np.random.randn(11, 4), columns=['alpha', 'beta', 'gamma', 'delta'], index=pd.date_range('20130101', periods=11))

display( labeled.shape )
labeled.index

(11, 4)

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06', '2013-01-07', '2013-01-08',
               '2013-01-09', '2013-01-10', '2013-01-11'],
              dtype='datetime64[ns]', freq='D')

_Exemple 2_

In [36]:
# Exemple 2 : Dataframe avec des lignes et des colonnes index√©es => les identifiants sont des num√©ros
indexed = pd.DataFrame(np.random.randn(11, 4), columns=['un', 'deux', 'trois', 'quatre'])

display( indexed.shape )
indexed.index

(11, 4)

RangeIndex(start=0, stop=11, step=1)

##### **4.1** - Indexation

Acc√®s aux lignes par index `.loc[index]`

In [37]:
# Exemple 1 : acc√®s a une ligne sp√©cifique
# labeled.loc['20130111'] # Type date : donc format Date compatible
labeled.loc['2013-01-11']

alpha    0.065082
beta    -0.306287
gamma   -0.201102
delta   -1.984806
Name: 2013-01-11 00:00:00, dtype: float64

In [38]:
# Exemple 2 : acc√®s √† une ligne
indexed.loc[2]

un        0.212391
deux     -0.272135
trois    -1.430112
quatre   -0.253449
Name: 2, dtype: float64

In [39]:
# Exemple 1 : plages de lignes
labeled.loc['20130104':'20130108']

               alpha      beta     gamma     delta
2013-01-04  0.930780 -1.463162 -0.928200 -0.966827
2013-01-05 -1.337507  0.880116  0.271957  1.250498
2013-01-06  2.452008  0.894744 -1.245788 -0.332055
2013-01-07 -0.475310 -2.555840 -0.194470 -0.204335
2013-01-08  0.646391  0.822461  1.331894  1.037657

In [40]:
# Exemple 2 : plage de lignes
indexed.loc[2:5]

         un      deux     trois    quatre
2  0.212391 -0.272135 -1.430112 -0.253449
3 -0.019018  1.852527 -0.336929 -2.725833
4 -0.418680  0.201561  0.854195  0.662988
5  1.250129  1.186729  1.089045 -0.144235

In [41]:
# Exemple 1 : multiples lignes non-successives
labeled.loc[['20130103', '20130101', '20130110']]

               alpha      beta     gamma     delta
2013-01-03 -0.538680 -1.226930 -1.659549 -0.583458
2013-01-01  0.188747 -1.002703 -1.374875  0.374824
2013-01-10  0.108863  0.488366  0.060632  0.834717

In [42]:
# Exemple 2 : multiples lignes non-sucessives
indexed.loc[[1, 4, 6]]

         un      deux     trois    quatre
1  0.713001 -0.487512  0.462404 -1.061874
4 -0.418680  0.201561  0.854195  0.662988
6 -1.480007 -0.363628 -1.340596 -0.337328

Acc√®s aux lignes par position `.iloc[pos]`

In [43]:
# Exemple 1 : acc√®s √† la ligne en derni√®re position (id√©pendamment de l'index r√©el)
labeled.iloc[-1]

alpha    0.065082
beta    -0.306287
gamma   -0.201102
delta   -1.984806
Name: 2013-01-11 00:00:00, dtype: float64

In [44]:
# Exemple 2 : acc√®s √† la ligne en derni√®re position - [!] `iloc[]`
indexed.iloc[-1]

un        0.068847
deux     -0.522735
trois     1.680595
quatre   -0.191101
Name: 10, dtype: float64

In [45]:
# Exemple 1 : plage de lignes (id√©pendamment de l'index r√©el)
labeled.iloc[2:6]

               alpha      beta     gamma     delta
2013-01-03 -0.538680 -1.226930 -1.659549 -0.583458
2013-01-04  0.930780 -1.463162 -0.928200 -0.966827
2013-01-05 -1.337507  0.880116  0.271957  1.250498
2013-01-06  2.452008  0.894744 -1.245788 -0.332055

In [46]:
# Exemple 1 : plage des lignes dans les 3 derni√®res positions
labeled.iloc[-3:]

               alpha      beta     gamma     delta
2013-01-09 -0.074246  0.228902  0.432684  1.031130
2013-01-10  0.108863  0.488366  0.060632  0.834717
2013-01-11  0.065082 -0.306287 -0.201102 -1.984806

In [47]:
# Exemple 2 : plage des lignes dans les 3 derni√®res positions - [!] `iloc[]`
indexed.iloc[-3:]

          un      deux     trois    quatre
8  -0.327451 -0.404725  0.458953  0.142801
9  -0.396924  0.820720 -0.415696 -0.970237
10  0.068847 -0.522735  1.680595 -0.191101

In [48]:
# Exemple 1 : multiples lignes non-successives
labeled.iloc[[2, 0, 9]]

               alpha      beta     gamma     delta
2013-01-03 -0.538680 -1.226930 -1.659549 -0.583458
2013-01-01  0.188747 -1.002703 -1.374875  0.374824
2013-01-10  0.108863  0.488366  0.060632  0.834717

##### **4.2** - S√©lection

Acc√®s aux colonnes par leurs noms `['name_col']`

In [49]:
# Colonne individuelle (2 premi√®res lignes)
labeled['alpha'].head(2)

2013-01-01    0.188747
2013-01-02    1.345073
Freq: D, Name: alpha, dtype: float64

In [50]:
# Multiples colonnes non-successives
labeled[['alpha', 'gamma']].head(2)

               alpha     gamma
2013-01-01  0.188747 -1.374875
2013-01-02  1.345073  1.034330

In [51]:
# Ordre sp√©cifique
labeled[['gamma', 'alpha', 'delta']].head(3)

               gamma     alpha     delta
2013-01-01 -1.374875  0.188747  0.374824
2013-01-02  1.034330  1.345073  0.172164
2013-01-03 -1.659549 -0.538680 -0.583458

Acc√®s aux colonnes par `.loc[]` et `iloc[]`

In [52]:
# Plages de colonnes
display( labeled.loc[:, ::2].head(2) )

labeled.iloc[:2, 1:3]

               alpha     gamma
2013-01-01  0.188747 -1.374875
2013-01-02  1.345073  1.034330

                beta     gamma
2013-01-01 -1.002703 -1.374875
2013-01-02 -0.709330  1.034330

In [53]:
# Plage de colonnes nomm√©es
labeled.loc[::4, 'alpha':'gamma']

               alpha      beta     gamma
2013-01-01  0.188747 -1.002703 -1.374875
2013-01-05 -1.337507  0.880116  0.271957
2013-01-09 -0.074246  0.228902  0.432684

In [54]:
# Multiples colonnes non-successives et ordre sp√©cifique
labeled.iloc[::3, [0, 3, 1]]

               alpha     delta      beta
2013-01-01  0.188747  0.374824 -1.002703
2013-01-04  0.930780 -0.966827 -1.463162
2013-01-07 -0.475310 -0.204335 -2.555840
2013-01-10  0.108863  0.834717  0.488366

In [55]:
# Multiples colonnes non-successives
display( labeled.loc['2013-01-01':'2013-01-04', ['gamma', 'alpha']] )

labeled.iloc[:4, [2, 0]]

               gamma     alpha
2013-01-01 -1.374875  0.188747
2013-01-02  1.034330  1.345073
2013-01-03 -1.659549 -0.538680
2013-01-04 -0.928200  0.930780

               gamma     alpha
2013-01-01 -1.374875  0.188747
2013-01-02  1.034330  1.345073
2013-01-03 -1.659549 -0.538680
2013-01-04 -0.928200  0.930780

##### **4.3** - Indexation bool√©enne

S√©lections conditionn√©es avec `&` et `|`. Utiliser les `()` pour les conditions multiples.

In [56]:
# Format de Dataframe classique
classic = pd.DataFrame(np.random.randn(11, 4), columns=['alpha', 'beta', 'gamma', 'delta'])
classic

       alpha      beta     gamma     delta
0  -1.277267 -0.852198 -0.026190  0.682208
1  -0.424436  0.260324 -0.170499 -2.414962
2   2.469984 -0.243487  0.059456 -0.051366
3   0.020304  0.362217 -1.290370  0.479621
4   0.110011  1.097711 -0.953415 -0.547983
5  -0.472797 -0.467502 -0.970903  1.032802
6  -0.992668  1.718400 -0.327635 -0.524092
7  -1.542156 -1.298453 -0.323094 -1.329945
8  -0.065085  0.899844  0.499088  0.628162
9  -1.049973 -0.444208 -1.155985  0.069735
10 -0.752793  1.510164 -1.373345 -0.182891

Condition unique

In [57]:
# Condition unique : toutes les lignes o√π 'beta' est sup√©rieur √† 0.5
classic[classic['beta'] > 0.5]

       alpha      beta     gamma     delta
4   0.110011  1.097711 -0.953415 -0.547983
6  -0.992668  1.718400 -0.327635 -0.524092
8  -0.065085  0.899844  0.499088  0.628162
10 -0.752793  1.510164 -1.373345 -0.182891

In [58]:
# Condition unique : voir seulement les colonnes 'gamma' et 'delta'
classic.loc[classic['alpha'] <= 0.5, ['gamma', 'delta']]

       gamma     delta
0  -0.026190  0.682208
1  -0.170499 -2.414962
3  -1.290370  0.479621
4  -0.953415 -0.547983
5  -0.970903  1.032802
6  -0.327635 -0.524092
7  -0.323094 -1.329945
8   0.499088  0.628162
9  -1.155985  0.069735
10 -1.373345 -0.182891

Conditions multiples

In [59]:
# Conditions multiples : toutes les lignes o√π 'alpha' est inf√©rieur √† 0 et 'delta' est sup√©rieur ou √©gal √† 0.5
classic[(classic['alpha'] < 0) & (classic['delta'] >= 0.5)]

      alpha      beta     gamma     delta
0 -1.277267 -0.852198 -0.026190  0.682208
5 -0.472797 -0.467502 -0.970903  1.032802
8 -0.065085  0.899844  0.499088  0.628162

In [60]:
# Conditions multiples : voir uniquement les colonnes 'alpha' et 'delta'
classic.loc[(classic['alpha'] < 0) & (classic['delta'] >= 0.2), ['alpha', 'delta']]

      alpha     delta
0 -1.277267  0.682208
5 -0.472797  1.032802
8 -0.065085  0.628162

##### **4.4** - √âdition (cas pratiques)

In [61]:
# Constitution d'un nouveau DataFrame et r√©initialisation des index
weather_data = raw_data.copy()
weather_data = weather_data.reset_index()
weather_data

        city  temp_c          o3
0  Bruxelles    23.0  114.400002
1      Namur    22.0  108.699997
2   New-York    21.1    0.600000
3  Shablagou     NaN         NaN
4      Tokyo    29.0   73.699997

Modification d'une valeur via **indexation bool√©enne**

In [62]:
# Changement d'une valeur
weather_data.loc[weather_data['city'] == "Bruxelles", 'temp_c'] = 25.2
weather_data

        city  temp_c          o3
0  Bruxelles    25.2  114.400002
1      Namur    22.0  108.699997
2   New-York    21.1    0.600000
3  Shablagou     NaN         NaN
4      Tokyo    29.0   73.699997

Nouvelle colonne et **assignation unique**

In [63]:
# Nouvelle colonne bas√©e sur la temp√©rature : valeur identique partout
weather_data['status'] = np.nan
weather_data['normal'] = np.zeros(shape=(5))
weather_data

        city  temp_c          o3  status  normal
0  Bruxelles    25.2  114.400002     NaN     0.0
1      Namur    22.0  108.699997     NaN     0.0
2   New-York    21.1    0.600000     NaN     0.0
3  Shablagou     NaN         NaN     NaN     0.0
4      Tokyo    29.0   73.699997     NaN     0.0

**Assignation multiple** via indexation bool√©enne

In [64]:
# Valeur sp√©cifique √† chaque cas
weather_data.loc[weather_data['temp_c'] >= 25, 'status'] = "Chaud"
weather_data.loc[weather_data['temp_c'] < 25, 'status'] = "Froid"

weather_data.loc[(weather_data['city'] == "Shablagou") | (weather_data['city'] == "New-York"), 'normal'] = np.ones(shape=2)

weather_data

        city  temp_c          o3 status  normal
0  Bruxelles    25.2  114.400002  Chaud     0.0
1      Namur    22.0  108.699997  Froid     0.0
2   New-York    21.1    0.600000  Froid     1.0
3  Shablagou     NaN         NaN    NaN     1.0
4      Tokyo    29.0   73.699997  Chaud     0.0

Conversion de types

In [65]:
# Convertir un type : colonnes en True / False sont en g√©n√©ralement des integers 0 et 1
display( weather_data['normal'].dtypes )
weather_data['normal'] = weather_data['normal'].astype(np.int8)
weather_data['normal']

dtype('float64')

0    0
1    0
2    1
3    1
4    0
Name: normal, dtype: int8

In [66]:
# Suppression de valeur NaN : exemple 
# NaN in Fare 
# data_pre.loc[data_pre['fare'].isnull(), 'fare'] = data_pre.loc[data_pre['pclass'] == 3 , 'fare'].median()
# data_pre.loc[data_pre['pclass'] == 3, 'fare'].info()

# NaN in Age
# data_pre.loc[data_pre['age'].isnull(), ['pclass', 'fare', 'sex']].value_counts()

##### **4.5** - Sp√©cificit√©s syntaxiques

In [67]:
# Cas d'exemple avec `stroke_data.csv`
stroke_csv = '../_datasets/stroke_data.csv'
stroke_data = pd.read_csv(stroke_csv)
stroke_data

,id,gender,age,hypertension,heart_disease,ever_married,work_type,Residence_type,avg_glucose_level,bmi,smoking_status,stroke
0,9046,Male,67.0,0,1,Yes,Private,Urban,228.69,36.6,formerly smoked,1
1,51676,Female,61.0,0,0,Yes,Self-employed,Rural,202.21,NaN,never smoked,1
2,31112,Male,80.0,0,1,Yes,Private,Rural,105.92,32.5,never smoked,1
...,...,...,...,...,...,...,...,...,...,...,...,...
5107,19723,Female,35.0,0,0,Yes,Self-employed,Rural,82.99,30.6,never smoked,0
5108,37544,Male,51.0,0,0,Yes,Private,Rural,166.29,25.6,formerly smoked,0
5109,44679,Female,44.0,0,0,Yes,Govt_job,Urban,85.28,26.2,Unknown,0

**Syntaxe 1 :** Plus lente
1. S√©lection de colonnes
2. Filtre sur les lignes

In [68]:
# S√©lection de colonnes ; Filtre sur les lignes

# %timeit stroke_data[['id', 'age', 'hypertension']].loc[[15, 20, 25]]
# Time : 701 ¬µs ¬± 26.4 ¬µs per loop (mean ¬± std. dev. of 7 runs, 1,000 loops each

stroke_data[['id', 'age', 'hypertension']].loc[[15, 20, 25]]

       id   age  hypertension
15  58202  50.0             1
20  70630  71.0             0
25  70822  80.0             0

**Syntaxe 2 :** Plus rapide
1. Filtre sur les lignes
2. S√©lection de colonnes

In [69]:
# Filtre sur les lignes ; S√©lection de colonnes

# %timeit stroke_data.loc[[15, 20, 25], ['id', 'age', 'hypertension']]
# Time : 627 ¬µs ¬± 3.24 ¬µs per loop (mean ¬± std. dev. of 7 runs, 1,000 loops each)

stroke_data.loc[[15, 20, 25], ['id', 'age', 'hypertension']]

       id   age  hypertension
15  58202  50.0             1
20  70630  71.0             0
25  70822  80.0             0

---
### **5.** Agr√©gations

##### **5.1** - Regroupement

M√©thode `.groupby()`

In [70]:
# Regroupement par 'stroke' puis par 'gender'
stroke_data[['age', 'stroke', 'gender']].groupby(['stroke', 'gender']).mean()

                     age
stroke gender
0      Female  42.601935
       Male    41.083388
       Other   26.000000
1      Female  67.137021
       Male    68.500000

In [71]:
# Regroupement par 'gender' puis par 'stroke'
stroke_data[['age', 'stroke', 'gender']].groupby(['gender', 'stroke']).mean()

                     age
gender stroke
Female 0       42.601935
       1       67.137021
Male   0       41.083388
       1       68.500000
Other  0       26.000000

M√©thode `.count()`

In [72]:
# Compter : toutes les valeurs non-nulles
stroke_data.count()

id                   5110
gender               5110
age                  5110
hypertension         5110
heart_disease        5110
ever_married         5110
work_type            5110
Residence_type       5110
avg_glucose_level    5110
bmi                  4909
smoking_status       5110
stroke               5110
dtype: int64

In [73]:
# Compter : s√©lection de colonnes
stroke_data[['bmi', 'age']].count()

bmi    4909
age    5110
dtype: int64

M√©thode `.value_counts()`

In [74]:
# Compter des valeurs 
stroke_data.value_counts()

id     gender  age   hypertension  heart_disease  ever_married  work_type  Residence_type  avg_glucose_level  bmi   smoking_status   stroke
77     Female  13.0  0             0              No            children   Rural           85.81              18.6  Unknown          0         1
49605  Male    63.0  0             0              Yes           Private    Urban           74.39              31.0  formerly smoked  0         1
49661  Male    53.0  0             0              Yes           Govt_job   Urban           85.17              29.2  never smoked     0         1
                                                                                                                                              ..
25107  Female  47.0  0             0              Yes           Private    Urban           65.04              30.9  never smoked     0         1
25102  Female  51.0  0             0              Yes           Govt_job   Urban           95.16              42.7  formerly smoked  0         1
72940  Female  2.0   0             0              No            children   Urban           102.92             17.6  Unknown          0         1
Length: 4909, dtype: int64

In [75]:
# Compter les valeurs d'une colonne
stroke_data.value_counts('bmi')

bmi
28.7    41
28.4    38
26.1    37
        ..
47.4     1
47.1     1
97.6     1
Length: 418, dtype: int64

In [76]:
# Compter plusieurs colonnes
stroke_data.value_counts( ['gender', 'stroke'] )

gender  stroke
Female  0         2853
Male    0         2007
Female  1          141
Male    1          108
Other   0            1
dtype: int64

M√©thode `.unique()` et `.nunique()`

In [77]:
# Distinguer les valeurs uniques d'une colonne
stroke_data['stroke'].unique()

array([1, 0], dtype=int64)

In [94]:
# Distinguer les valeurs uniques d'un DataFrame
stroke_data.nunique()

id                   5110
gender                  3
age                   104
hypertension            2
heart_disease           2
ever_married            2
work_type               5
Residence_type          2
avg_glucose_level    3979
bmi                   418
smoking_status          4
stroke                  2
dtype: int64

##### **5.2** - Statistiques

Description g√©n√©rale `.describe()`

In [78]:
# Synth√®se statistique sur un DataFrame complet
stroke_data.describe()

,id,age,hypertension,heart_disease,avg_glucose_level,bmi,stroke
count,5110.000000,5110.000000,5110.000000,5110.000000,5110.000000,4909.000000,5110.000000
mean,36517.829354,43.226614,0.097456,0.054012,106.147677,28.893237,0.048728
std,21161.721625,22.612647,0.296607,0.226063,45.283560,7.854067,0.215320
min,67.000000,0.080000,0.000000,0.000000,55.120000,10.300000,0.000000
25%,17741.250000,25.000000,0.000000,0.000000,77.245000,23.500000,0.000000
50%,36932.000000,45.000000,0.000000,0.000000,91.885000,28.100000,0.000000
75%,54682.000000,61.000000,0.000000,0.000000,114.090000,33.100000,0.000000
max,72940.000000,82.000000,1.000000,1.000000,271.740000,97.600000,1.000000

In [79]:
# Somme :: Toutes les valeurs (sans distinction)
display( stroke_data.sum() )

# Somme :: Valeurs calculables uniquement
display( stroke_data.sum(numeric_only=True) ) 

# Somme :: S√©lection de colonnes
stroke_data[['age', 'avg_glucose_level']].sum()

id                                                           186606108
gender               MaleFemaleMaleFemaleFemaleMaleMaleFemaleFemale...
age                                                           220888.0
hypertension                                                       498
heart_disease                                                      276
ever_married         YesYesYesYesYesYesYesNoYesYesYesYesYesYesYesYe...
work_type            PrivateSelf-employedPrivatePrivateSelf-employe...
Residence_type       UrbanRuralRuralUrbanRuralUrbanRuralUrbanRuralU...
avg_glucose_level                                            542414.63
bmi                                                           141836.9
smoking_status       formerly smokednever smokednever smokedsmokesn...
stroke                                                             249
dtype: object

id                   1.866061e+08
age                  2.208880e+05
hypertension         4.980000e+02
heart_disease        2.760000e+02
avg_glucose_level    5.424146e+05
bmi                  1.418369e+05
stroke               2.490000e+02
dtype: float64

age                  220888.00
avg_glucose_level    542414.63
dtype: float64

Moyenne avec `.mean()`

In [80]:
# Moyennes des les valeurs calculables uniquement
stroke_data.mean(numeric_only=True)

id                   36517.829354
age                     43.226614
hypertension             0.097456
heart_disease            0.054012
avg_glucose_level      106.147677
bmi                     28.893237
stroke                   0.048728
dtype: float64

In [81]:
# Moyennes des colonnes sp√©cifiques
stroke_data[['age', 'hypertension', 'bmi']].mean()

age             43.226614
hypertension     0.097456
bmi             28.893237
dtype: float64

M√©dianne avec `.median()`

In [82]:
# M√©dianne des valeurs calculables
stroke_data.median(numeric_only=True)

id                   36932.000
age                     45.000
hypertension             0.000
heart_disease            0.000
avg_glucose_level       91.885
bmi                     28.100
stroke                   0.000
dtype: float64

In [83]:
# M√©diane d'une colonne
stroke_data['age'].median()

45.0

√âcart-type avec `.std()`

In [84]:
# √âcart Type d'une colonne
stroke_data['hypertension'].std()

0.29660667423379117

In [85]:
# √âcart Type de colonnes sp√©cifiques
stroke_data[['age', 'bmi']].std()

age    22.612647
bmi     7.854067
dtype: float64

Minimum et maximum avec `.min()` et `.max()`

In [86]:
# Valeur Minimum
display(stroke_data['age'].min())

# Valeur Maximum
display(stroke_data['age'].max())

0.08

82.0

Quartiles avec `.quantile()`

In [87]:
# 1er Quartile
display(stroke_data['bmi'].quantile(q=.25))

# 2e Quartile
display(stroke_data['bmi'].quantile(q=.5))

# 3e Quartile
stroke_data['bmi'].quantile(q=.75)

23.5

28.1

33.1

##### **5.3** - Calculs (cas pratiques)

**√âcart inter-quartile** et **valeurs aberrantes**

In [88]:
# Calcul des √©carts inter-quartile
q25 = stroke_data[['avg_glucose_level', 'bmi']].quantile(.25)
q75 = stroke_data[['avg_glucose_level', 'bmi']].quantile(.75)
iqr = q75 - q25
iqr

avg_glucose_level    36.845
bmi                   9.600
dtype: float64

In [89]:
# Calcul des limites maximum hors excluant les valeurs aberrantes
uppers = q75 + (1.5 * iqr)
uppers

avg_glucose_level    169.3575
bmi                   47.5000
dtype: float64

**Normalisation** et **pourcentage**

In [90]:
# Pourcentage du genre dans le dataset
stroke_data.value_counts('gender', normalize=True, ascending=True) * 100

gender
Other      0.019569
Male      41.389432
Female    58.590998
dtype: float64

In [91]:
# Comment se r√©partissent les H et les F avec ou sans AVC ? 
# => Compter, normaliser (0 √† 1), et statistifier en %
stroke_data.value_counts(['gender', 'stroke'], normalize=True) * 100

# (!) Pas de diff√©rence r√©ellement significative entre les H et le F en cas d'AVC

gender  stroke
Female  0         55.831703
Male    0         39.275930
Female  1          2.759295
Male    1          2.113503
Other   0          0.019569
dtype: float64

In [92]:
# Est-ce que la diff√©rence d'age est significative ou non ?
# => Calculer la moyenne d'age par 'stroke'
stroke_data[['age', 'stroke']].groupby('stroke').mean()

              age
stroke
0       41.971545
1       67.728193